print('Задача 3. Почта')
#Василий пришёл получать посылку на почту. Разумеется, в почтовом извещении ему нужно было написать свои фамилию, имя и адрес проживания,
#чтобы кто-нибудь не получил посылку за него, например члены его семьи (а им бы хотелось!).
#Напишите функцию для вывода фамилии, имени и адреса для конкретного члена семьи. Выведите информацию о нём три раза (без цикла).
#Пример результата:
#Фамилия: Иванов
#Имя: Василий
#Улица: Пушкина
#Дом: 32

#Фамилия: Иванов
#Имя: Василий
#Улица: Пушкина
#Дом: 32


#Фамилия: Иванов
#Имя: Василий
#Улица: Пушкина
#Дом: 32

def myAdress():
    print('Фамилия: Иванов')
    print('Имя: Василий')
    print('Улица: Пушкина')
    print('Дом: 32')
    print()


myAdress()
myAdress()
myAdress()