print('Задача 3. Театр')

# В городе планируют построить театр под открытым небом, но для начала нужно оценить, сколько сделать рядов, сидений в них и каким должно быть расстояние между рядами.

# Что нужно сделать

# Напишите программу, которая получает на вход количество рядов, сидений и свободных метров между рядами, а затем выводит примерный макет театра на экран.


# Сцена
# Введите кол-во рядов: 5
# Введите кол-во сидений ряду: 7
# Введите кол-во метров между рядами: 3
#
# ======= *** =======
# ======= *** =======
# ======= *** =======
# ======= *** =======
# ======= *** =======

ryad = int(input('Введите кол-во рядов: '))
sidenya = int(input('Введите кол-во сидений ряду: '))
dist = int(input('Введите кол-во метров между рядами: '))
print()

for _ in range(ryad):
  for i in range(1):
    print('=' * sidenya  + ' ', ' ' + '=' * sidenya,  sep = '*' * dist)