#На вход программе подается строка текста, содержащая слова. Напишите программу, которая выводит слова введенной строки в столбик.
# put your python code here
print(*input().split(), sep = '\n')