#Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.
# put your python code here

a = int(input('Введите число: '))
b = int(input('Введите число: '))
c = int(input('Введите число: '))
print(a + b + c)