#Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.
# put your python code here
a = int(input('Введите число: '))
b = a + 1
c = b + 1
print(a)
print(b)
print(c)