#Напишите программу вычисления значения функции по введеным целым значениям a и b.
a = int(input('Введите значение a: '))
b = int(input('Введите значение b: '))
f = 3 * (a + b) ** 3 + 275 * b ** 2 - 127 * a - 41
print(f)