#Напишите программу, которая находит полное число метров по заданному числу сантиметров.
a = int(input('Введите кол-во сантиметров: '))

print(a // 100)