#На вход программе подаётся одно целое положительное число n, n ∈ [1;9].

n = int(input())
print(n + n * 11 + n * 111)