#Красный, синий и желтый называются основными цветами, потому что их нельзя получить путем смешения других цветов. При смешивании двух основных цветов получается вторичный цвет:если смешать красный и синий, то получится фиолетовый;если смешать красный и желтый, то получится оранжевый;если смешать синий и желтый, то получится зеленый.
#Напишите программу, которая считывает названия двух основных цветов для смешивания. Если пользователь вводит что-нибудь помимо названий «красный», «синий» или «желтый», то программа должна вывести сообщение об ошибке. В противном случае программа должна вывести название вторичного цвета, который получится в результате.
a = input()
b = input()

if (a == 'красный' or b == 'красный') and (a == 'синий' or b == 'синий'):
    print('фиолетовый')
elif a == 'красный' and b == 'красный':
    print('красный')
elif (a == 'красный' or b == 'красный') and (a == 'желтый' or b == 'желтый'):
    print('оранжевый')
elif a == 'синий' and b == 'синий':
    print('синий')
elif (a == 'синий' or b == 'синий') and (a == 'желтый' or b == 'желтый'):
    print('зеленый')
elif a == 'желтый' and b == 'желтый':
    print('желтый')
else:
    print('ошибка цвета')



