#Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу: «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».

x = input()
y = len(x)
print('Футбольная команда', x, 'имеет длину', y, 'символов')