#Даны пять чисел a1, a2, a3, a4, a5. Напишите программу, которая вычисляет сумму их модулей ∣a1∣ + ∣a2∣ + ∣a3∣ + ∣a4​∣ + ∣a5∣.
#Программа должна вывести одно число – сумму модулей введённых чисел.
a = abs(float(input()))
b = abs(float(input()))
c = abs(float(input()))
d = abs(float(input()))
e = abs(float(input()))

print(a + b + c + d + e)