#Напишите программу определяющую площадь круга и длину окружности по заданному радиусу R.

from math import *
a = float(input())
s = pi * (a) ** 2
c = 2 * pi * (a)
print(s)
print(c)